Revit 2027 API
ModelCurveArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ModelCurveArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As ModelCurveArrayIterator
public:
virtual ModelCurveArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> ModelCurveArrayIterator
override ForwardIterator : unit -> ModelCurveArrayIterator
Return Value
ModelCurveArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
ModelCurveArray Class
Autodesk.Revit.DB Namespace